import re
from datetime import datetime, timezone, timedelta
from itertools import chain

TIMEZONE = timezone(timedelta(hours=9), "JST")

EVENT_NAME = "RTA in Japan Summer 2025"

# (ward to plot, line style, color)
RTA_EMOTES = (
    ("rtaClap", "-", "#ec7087"),
    (("rtaGg", "GG"), "-", "#ff381c"),
    (("rtaGl", "GL"), "-", "#5cc200"),
    ("rtaPray", "-", "#f7f97a"),
    ("rtaR", "-", "white"),
    ("rtaHatena", "-", "#ffb5a1"),
    ("rtaCheer", "-", "#ffbe00"),
    ("rtaCry", "-", "#5ec6ff"),

    ("rtaFear", "-.", "#8aa0ec"),
    ("rtaMuscle", "-.", "#fcc7b9"),
    ("rtaListen", "-.", "#5eb0ff"),
    ("rtaPokan", "-.", "#838187"),
    ("rtaUp", "-.", "#df4f69"),
    ("rtaHmm", "-.", "#c80730"),
    ("rtaDeath", "-.", "#ffbe00"),
    ("rtaKabe", "-.", "#bf927a"),
    ("rtaDaba", "-.", "white"),

    ("rtaIce", ":", "#CAEEFA"),
    ("rtaHeart", ":", "#ff3291"),
    ("rtaFire", ":", "#E56124"),
    ("rtaLight", ":", "#5aafdd"),
    ("rtaGamingr", ":", "white"),
    ("rtaWut", ":", "#d97f8d"),
    ("rtaPolice", ":", "#7891b8"),
    ("rtaPog", ":", "#f8c900"),
    ("rtaGlitch", ":", "#9F65B2"),
    ("rtaThink", ":", "#f3f905"),

    # ("rtaBanana", ":", "#f3f905"),
    # ("rtaShogi", ":", "#c68d46"),
    # ("rtaIizo", ":", "#0f9619"),
    # ("rtaHello", ":", "#ff3291"),
    # ("rtaMaru", ":", "#c80730"),
    # ("rtaThunder", ":", "#F5D219"),
    # ("rtaPoison", ":", "#9F65B2"),
    # ("rtaWind", ":", "#C4F897"),
    # ("rtaOko", "-.", "#d20025"),
    # ("rtaChan", "-.", "green"),
    # ("rtaKappa", "-.", "#ffeae2"),
    # ("rtaSleep", "-.", "#ff8000"),
    # ("rtaCafe", "--", "#a44242"),
    # ("rtaDot", "--", "#ff3291"),
    # ("rtaShi", ":", "#8aa0ec"),
    # ("rtaGift", ":", "white"),
    # ("rtaAnkimo", ":", "#f92218 "),

    (("草", "ｗｗｗ", "LUL"), "--", "#1e9100"),
    ("DinoDance", "--", "#00b994"),
    # ("rtaFrameperfect", "--", "#ff7401"),
    # ("rtaPixelperfect", "--", "#ffa300"),
    ("Cheer（ビッツ）", "--", "#bd62fe"),
    ("無敵時間", "--", "red"),
    # ("石油王", "--", "yellow"),
    # ("かわいい", "--", "#ff3291")
)

VOCABULARY = set(w for w, _, _, in RTA_EMOTES if isinstance(w, str))
VOCABULARY |= set(chain(*(w for w, _, _, in RTA_EMOTES if isinstance(w, tuple))))

# (title, movie start time as timestamp, offset hour, min, sec)
GAMES = (
    ('開幕の\nあいさつ', 1754685317, 0, 20, 58, 'right'),
    ('Cuphead', 1754685317, 0, 29, 10),
    ('E.T.\nThe Extra-Terrestrial', 1754685317, 1, 36, 42, 'right'),
    ('悪魔城ドラキュラXX', 1754685317, 1, 54, 3),
    ('\nDead Cells', 1754685317, 2, 21, 0),
    ('古明地さとりの情操教育', 1754685317, 2, 48, 10),
    ('爆ボンバーマン', 1754685317, 3, 42, 39),
    ('Radiant Silvergun', 1754685317, 5, 7, 13),
    ('Windowkill', 1754685317, 6, 12, 10, 'right'),
    ('Looney\nTunes\nロードランナーvsワイリーコヨーテ', 1754685317, 6, 37, 16, 'right'),
    ('真・三國無双7\nwith 猛将伝', 1754685317, 7, 2, 51),
    ('ファイナル\nファイト\n（カプコンベルトアクションコレクション）', 1754685317, 7, 53, 41),
    ('新・熱血硬派 くにおたちの挽歌\n-with River City Girls Extra-', 1754685317, 8, 27, 1),
    # ('姐', 1754685317, 9, 33, 12),
    ('', 1754685317, 9, 33, 12),
    ('アーネスト\n・エバンス', 1754685317, 9, 59, 21),
    ('いただきストリート ゴージャスキング', 1754685317, 10, 24, 12),
    ('METAL MAX2', 1754685317, 14, 29, 54),
    ('Xeno Runners', 1754685317, 16, 14, 19, 'right'),
    ('ミスタードリラーアンコール', 1754685317, 16, 42, 35),
    ('北海道4,000km\n道内全市町村踏破', 1754685317, 18, 22, 38),
    ('Smushi\nCome Home', 1754685317, 19, 13, 11),
    ('アメリカンバトルドーム', 1754685317, 20, 36, 48, 'right'),
    ('カラスのおしごと', 1754685317, 21, 36, 17, 'right'),
    ('サカつく2002\nJ.LEAGUEプロサッカークラブをつくろう!', 1754685317, 22, 10, 25, 'right'),
    ('Inscryption', 1754685317, 25, 28, 1),
    ('ウルトラ怪獣モンスターファーム', 1754685317, 26, 20, 28),
    ('Super Puzzled Cat', 1754685317, 28, 11, 55, 'right'),
    ('アメリカ横断ウルトラクイズ', 1754685317, 28, 38, 27),
    ('メタルギア\nソリッド\nインテグラル', 1754685317, 29, 34, 44),
    ('Climbing In Barrel\nWith Double-Barrel', 1754685317, 31, 4, 36, 'right'),
    ('Final Fantasy IX', 1754685317, 31, 24, 31),
    ('Celeste', 1754831494, 0, 8, 27),
    ("ときめきメモリアル\nGirl's Side 4th Heart", 1754831494, 0, 53, 20),
    ('Chants of Sennaar', 1754831494, 2, 4, 41),
    ('ルミネス リマスター', 1754831494, 3, 57, 5, 'right'),
    ('救国のスネジンカ:\nSentinel Girls2', 1754831494, 4, 43, 22),
    ('Shadow Corridor', 1754831494, 5, 21, 8),
    ('ロックマン9\n野望の復活!!', 1754831494, 6, 20, 42),
    ('ロックマンDASH 鋼の冒険心', 1754831494, 7, 5, 58),
    ('東方永夜抄\n〜 Imperishable Night.', 1754831494, 8, 11, 52),
    ('Nova Drift', 1754831494, 8, 57, 48),
    ('アフターイメージ', 1754831494, 9, 37, 8),
    ('NieR:Automata', 1754831494, 10, 11, 42),
    ('Salt and Sanctuary', 1754831494, 11, 45, 8, 'right'),
    ('Barbie: Super Model', 1754831494, 12, 41, 0, 'right'),
    ('デジモンワールド', 1754831494, 12, 54, 0),
    ('DEMENTO', 1754831494, 14, 31, 25),
    ('青鬼(2024)', 1754831494, 15, 54, 37, 'right'),
    ('BIOHAZARD\nRE:2', 1754831494, 16, 17, 37),
    ('\nSILENT HILL 2 (2024)', 1754831494, 16, 37, 54),
    ('モンスターハンター2（ドス）', 1754831494, 18, 58, 37, 'right'),
    ('ロマンシング サガ3 HDリマスター', 1754831494, 23, 28, 28),
    ('新鬼武者', 1754831494, 26, 39, 20),
    ('Noita', 1754831494, 28, 34, 49),
    ('松方弘樹のスーパートローリング', 1754831494, 29, 24, 16),
    ('Radical Relocation', 1754831494, 30, 59, 23),
    ('パウ・パトロール：ザ・ムービー\nアドベンチャーシティがよんでいる', 1754831494, 31, 40, 6),
    ('カンパニーマン 社畜の下剋上', 1754831494, 32, 46, 39),
    ('アリス・エスケイプト！', 1754831494, 33, 47, 4),
    # ('ドラゴンクエストIV 導かれし者たち', 1754831494, 34, 32, 7),
    ('ドラゴンクエストIV 導かれし者たち', 1754831494, 34, 32, 30),
    ('ドラゴンクエストモンスターズ キャラバンハート', 1754831494, 37, 15, 19),
    ('14 Minesweeper Variants', 1754831494, 41, 11, 49),
    ('真・女神転生if...', 1754831494, 42, 6, 13),
    ('クロノアーク', 1754990483, 0, 6, 36),
    ('ZWEI2(ツヴァイ2)', 1754990483, 1, 2, 46),
    ('イースⅠクロニクルズ', 1754990483, 4, 47, 43, 'right'),
    ('機動戦士ガンダム 一年戦争', 1754990483, 5, 35, 41),
    ('SCHiM - スキム -', 1754990483, 7, 8, 48),
    ('ブレス オブ ファイアV ドラゴンクォーター', 1754990483, 8, 38, 25),
    ('Rhythm Doctor', 1754990483, 10, 7, 33),
    ('vivid/stasis', 1754990483, 11, 27, 4, 'right'),
    ('XI[sái]シリーズ\nトリロジーリレー', 1754990483, 12, 28, 22, 'right'),
    ('ロックマンエグゼ5', 1754990483, 14, 3, 25),
    ('魔界戦記ディスガイア6', 1754990483, 17, 33, 19),
    ('聖剣伝説3', 1754990483, 18, 24, 55),
    ('アーマード・コア ナインブレイカー', 1754990483, 23, 19, 43),
    ('Wattam', 1754990483, 28, 32, 49),
    ('ふしぎの城のヘレン+', 1754990483, 30, 13, 57),
    ('レスキューショット\nブービーぼー', 1754990483, 31, 9, 23),
    ('TOEM', 1754990483, 31, 51, 26),
    ('悠遠物語 ～空の大陸とアイテム屋さん～', 1754990483, 33, 21, 1),
    ('スーパーワギャンランド', 1754990483, 35, 22, 13, 'right'),
    ('TETRIS\nTHE GRAND MASTER 4\n-ABSOLUTE EYE-', 1754990483, 37, 35, 25),
    ('Death and\nTaxes', 1754990483, 38, 34, 5),
    ('フィリスのアトリエ\n～不思議な旅の錬金術士～ DX', 1754990483, 39, 3, 30),
    ('アーケードアーカイブス\nトリオ・ザ・パンチ', 1754990483, 41, 15, 37, 'right'),
    ('Wizardry: Proving Grounds\nof the Mad Overlord', 1754990483, 41, 58, 9),
    ('スゴイツヨイトウフ', 1754990483, 44, 31, 59, 'right'),
    ('ゲームセンターCX 有野の挑戦状 1+2 REPLAY', 1754990483, 45, 4, 19),
    ('ドラゴンファングZ', 1755161213, 0, 3, 9),
    ('DRAG-ON DRAGOON 3', 1755161213, 1, 52, 5),
    ('世界樹の迷宮II 諸王の聖杯\nHD REMASTER', 1755161213, 3, 57, 31, 'right'),
    ('ブリーチ\nヒート・ザ・ソウル7', 1755161213, 4, 55, 19, 'right'),
    ('ゴジラ怪獣大決戦', 1755161213, 5, 33, 22),
    ('ケツバトラー', 1755161213, 6, 10, 2),
    ('電車でGO!', 1755161213, 6, 53, 26),
    ('Minecraft\nJava Edition', 1755161213, 8, 7, 11),
    ('サルゲッチュ', 1755161213, 8, 44, 4),
    ('迷宮組曲 ミロンの大冒険', 1755161213, 10, 17, 16, 'right'),
    ('Cook, Serve, Delicious! 3?!', 1755161213, 10, 37, 15),
    ('The Elder Scrolls V: Skyrim', 1755161213, 11, 32, 59),
    ('みんな大好き塊魂\nアンコール＋王様プチメモリー', 1755161213, 12, 51, 37),
    ('Final Fantasy X-2 HD Remaster', 1755161213, 13, 47, 44),
    ('閉幕の\nあいさつ', 1755221118, 1, 1, 25)
)


class Game:
    def __init__(self, name, t, h, m, s, align="left"):
        self.name = name
        self.startat = datetime.fromtimestamp(t + h * 3600 + m * 60 + s).replace(tzinfo=timezone.utc).astimezone(TIMEZONE)
        self.align = align


GAMES = tuple(Game(*args) for args in GAMES)

WINDOWSIZE = 1
WINDOW = timedelta(seconds=WINDOWSIZE)
AVR_WINDOW = 60
PER_SECONDS = 60
FIND_WINDOW = 15
DOMINATION_RATE = 0.6
COUNT_THRESHOLD = 30

DPI = 200
ROW = 5
PAGES = 4
YMAX = 1000
WIDTH = 3840
HEIGHT = 2160

FONT_COLOR = "white"
FRAME_COLOR = "white"
BACKGROUND_COLOR = "#3f6392"
FACE_COLOR = "#274064"
ARROW_COLOR = "#ffff79"
MESSAGE_FILL_COLOR = "#0b0d2e"
MESSAGE_EDGE_COLOR = "#0080ff"

ALPHA = 0.5

BACKGROUND = "2025s.png"

EXCLUDE_MESSAGE_TERMS = (
    " subscribed with Prime",
    " subscribed at Tier ",
    " gifted a Tier ",
    " is gifting ",
    " raiders from "
)

PNS = (
    "無敵時間",
    "石油王",
    "国境なき医師団",
    "ナイスセーヌ",
    "ハイプトレイン",
    "そうはならんやろ",
    "強制スクロール",
    "ソードフィッシュ",
    "やったか",
    "おじょうず",
    "いつもの",
    "おじさん",
    "謎加速",
    "リモート成仏",
    "レッドローズプラズマ",
    "そろそろキャベツを食べないと死ぬぜ",
    "カニトケンカ",
    "怨念がおんねん",
    "鳥音波",
    "おじボム",
    "はむはー",
    "ばいきゅー",
    "天使とダンスだ",
    "環境破壊は",
    "やきう",
    "足スト",
    "ヨルダ落とし",
    "天才ランナー",
    "理不尽",
    "ファイファン",
    "ちゃんとしたバグ技",
    "おじいちゃん",
    "三銃士",
    "悲しきRTAマシーン",
    "いたりいなかったりしろ",
    "いたスト",
    "入ったり入らなかったりしろ",
    "自然な導入",
    "勾玉ビーム",
    "金返せ",
    "興味ないね",
    "おっくせんまん",
    "ファイナルアタック",
    "自主退職",
    "やめてね",
    "見損なったぞカーネル",
    "世に平穏のあらんことを",
    "なっとるやろがい",
    "ケツ断力",
    "どうしてぇ"
)

PN_PATTERNS = (
    # (re.compile("[\u30A1-\u30FF]+ケンカ"), "〜ケンカ"),
    (re.compile("[a-zA-Z]+[0-9]+"), "Cheer（ビッツ）"),
    (re.compile("世界[1１一]位?"), "世界一"),
    (re.compile("ヨシ！+"), "ヨシ！"),
    (re.compile("[＃#]?ブリオを許すな",), "ブリオを許すな"),
    (re.compile("(はちみつ|ハチミツ)ください"), "ハチミツください"),
    (re.compile("[＾^][＾^][；;]?"), "＾＾"),
    (re.compile("(何|なに)もしてい?ないのに"), "何もしてないのに"),
    (re.compile("大丈夫だ.問題ない"), "大丈夫だ、問題ない。"),
    (re.compile("て[えぇー]へんだ"), "てえへんだ"),
    (re.compile("[3３三]倍"), "3倍")
)

STOP_WORDS = (
    "Squid2",
    ''
)
